# GetAnalyticalModel Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
Element..::..GetAnalyticalModel Method
Element Class See Also
---
Retrieves writeable Analytical Model for Element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalyticalModel GetAnalyticalModel()
```

Visual Basic
---
```text
Public Function GetAnalyticalModel As AnalyticalModel
```

Visual C++
---
```text
public:
AnalyticalModel^ GetAnalyticalModel()
```

# ### Return Value
Writeable Analytical Model.
# Remarks
If the Element does not have an Analytical Model, the returned value will be NULL. This may occur even if the Element can have an Analytical Model, but does not for some reason.
# See Also
Element Class
Autodesk.Revit.DB Namespace